//вопросы, слабые места по курсу для меня
1. Недостаточно разобрался с темой потоков, по сути понятно, что происходит стало только после ваших примеров в разборе домашнего задания, java умеет только побайтово считывать? как быть в случае, например с видео?
2. Всё из той ж темы. Могу ли я присвоить переменной значение потока, потом закрыть поток без Флаша?(у меня не получилось, значение переменной становится пустой... Как рабоатет флаш? он хранит информацию до какого момента до закрытия приложения? 
3. Из последнего домашнего задания/вашего примера не очень понял про передачу в качестве параметров экземпляра класса, что конкретно мы из этого экземпляра передаем? Т.е. по дз всё работает, но понимания так и не пришло

package ru.geekbrains.gui;

public class gui {

    public static void main (String[] args) {
    new GameWindow();
    }

    //1ч . 18 мин
}
